[["Me emrin e Allahut, të Gjithëmëshirshmit, Mëshiruesit.", "Lavdërimi i takon Allahut, Zotit të botëve,", "të Gjithëmëshirshmit, Mëshiruesit,", "Sunduesit të Ditës së Gjykimit.", "Vetëm Ty të adhurojmë dhe vetëm prej Teje ndihmë kërkojmë.", "Udhëzona në rrugën e drejtë!", "Në rrugën e atyre që i begatove e jo në të atyre që kundër vetes tërhoqën hidhërimin, as në rrugën e të humburve!"], ["Elif, lam, mim.", "Ky është Libri në të cilin nuk ka dyshim; është udhërrëfyes për të devotshmit,", "të cilët besojnë në të fshehtën, e falin namazin dhe japin nga ajo që u kemi dhënë,", "e të cilët besojnë në atë që të është shpallur ty (o Muhamed) e në atë që është shpallur para teje dhe janë të bindur për botën tjetër.", "Ata janë të përudhur nga Zoti i tyre dhe mu ata janë të shpëtuarit.", "Sa për ata që mohojnë, është krejt njësoj: i paralajmërove apo nuk i paralajmërove, ata prapëseprapë nuk besojnë.", "Allahu ua ka vulosur zemrat dhe veshët, kurse në sytë e tyre ka perde. Ata i pret një dënim i madh.", "Ndër njerëz ka të atillë që thonë: \"Ne kemi besuar Allahun dhe Ditën e Fundit\", porse në të vërtetë ata nuk janë besimtarë.", "Ata përpiqen të mashtrojnë Allahun dhe besimtarët, por në të vërtetë ata mashtrojnë vetëm vetveten, ndonëse nuk e hetojnë.", "Në zemrat e tyre ka sëmundje (mëdyshje) e Allahu ua shton edhe më tej sëmundjen. Ata i pret një dënim i dhembshëm për shkak se gënjejnë.", "Kur atyre u thuhet: \"Mos bëni çrregullime në tokë!\", thonë: \"Ne bëjmë vetëm përmirësime\".", "Vini re! Pikërisht ata janë shkaktarët e çrregullimeve, megjithëse nuk e ndiejnë.", "E, kur atyre u thuhet: \"Besoni edhe ju siç besuan njerëzit e tjerë\", ata thonë: \"Vallë, të besojmë sikurse mendjelehtët?\" Vini re! Mu ata janë mendjelehtët, por nuk e dinë.", "Kur takohen me besimtarët, thonë: \"Ne besojmë\", por, kur mbesin vetëm me djajtë (krerët) e tyre, thonë: \"Ne përnjëmend jemi me ju, ne thjesht po talleshim\".", "Allahu është Ai që tallet me ta dhe i lë të bredhin verbërisht në humbjen e tyre.", "Ata këmbyen udhëzimin me humbjen, rrjedhimisht tregtia e tyre nuk u solli kurrfarë dobie e as që ishin të udhëzuar në rrugën e drejtë.", "Shembulli i tyre është sikurse shembulli i atyre që ndezin një zjarr dhe, kur ai ndriçon vendin rreth tyre, Allahu ua shuan dritën e i lë në errësirë të plotë, ku nuk mund të shohin.", "Ata janë të shurdhër, memecë dhe të verbër, prandaj nuk kthehen.", "Ose u ngjan atyre që, gjatë një shtrëngate nga qielli përplot errësirë, bubullimë e vetëtimë, i mbyllin veshët me gishtat e tyre për të mos dëgjuar ushtimën nga frika e vdekjes. Allahu i ka nën mbikëqyrje jobesimtarët.", "Vetëtima pothuajse ua merr shikimin. Sa herë që u bën dritë, ata ecin e, kur errësohet, shtangen. Po të donte Allahu, do t'ua merrte dëgjimin dhe shikimin. Vërtet Allahu është i Plotfuqishëm për çdo gjë.", "O njerëz! Adhurojeni Zotin tuaj, i Cili ju krijoi ju dhe ata që ishin para jush, që të bëheni të devotshëm.", "Ai jua bëri Tokën shtrat (vendqëndrim) e qiellin ndërtesë dhe nga qielli zbriti ujë, përmes të cilit nxori fruta si ushqim për ju. Prandaj, mos i sajoni Allahut ortakë, ndërkohë që ju e dini.", "E, në qoftë se dyshoni në atë që ia kemi zbritur robit Tonë (Muhamedit), atëherë sillni një sure të ngjashme me të dhe thirrni (në ndihmë) ndihmësit tuaj në vend të Allahut, nëse e thoni të vërtetën.", "Mirëpo, në qoftë se nuk mund ta bëni këtë, - gjë që kurrsesi nuk do të mund ta bëni, - atëherë ruajuni Zjarrit, lëndë djegëse e të cilit janë njerëzit e gurët dhe i cili është përgatitur për jobesimtarët.", "Ndërkaq, atyre që besojnë dhe bëjnë vepra të mira, jepua lajmin e mirë, se për ta do të jenë kopshtet e Xhenetit, nëpër të cilat rrjedhin lumenj. Sa herë që u shërbehet aty ndonjë frutë për të ngrënë, ata thonë: \"Këto i kemi ngrënë edhe më parë.\" Atyre do t'u jepen fruta të ngjashme (në pamje), për ta do të ketë bashkëshorte të dëlira dhe aty do të qëndrojnë përgjithmonë.", "Sigurisht që Allahu nuk ngurron të sjellë çfarëdo shembulli, qoftë dhe një mushkonjë ose diçka më të madhe a më të vogël se ajo. Ata që besojnë e dinë se kjo është e vërteta nga Zoti i tyre, kurse jobesimtarët thonë: \"Çfarë deshi të thotë Allahu me këtë shembull?\" Përmes tij, Allahu çon në humbje shumë njerëz dhe udhëzon shumë të tjerë. Në fakt, Ai i çon në humbje vetëm të pabindurit,", "të cilët e thyejnë besën e Allahut pasi e patën dhënë dhe i shkëpusin lidhjet të cilat Allahu ka urdhëruar të ruhen, si dhe bëjnë çrregullime në Tokë. Ata janë të humburit.", "Si mund ta mohoni Allahun, ndërkohë që ju nuk ishit në jetë e Ai jua dha jetën, pastaj do t'ju bëjë të vdisni, më pas do t'ju ringjallë dhe, në fund, do të ktheheni tek Ai?!", "Ai krijoi për ju çdo gjë që gjendet në Tokë, mandej iu drejtua qiellit duke krijuar e përsosur shtatë qiej. Ai është i Dijshëm për çdo gjë.", "Kujto kur Zoti yt u tha melekëve: \"Unë po krijoj një mëkëmbës në Tokë.\" Ata thanë: \"A do të krijosh në të të atillë që bëjnë trazira dhe derdhin gjak, ndonëse ne të lavdërojmë, të madhërojmë e të lartësojmë?!\" Ai tha: \"Unë di atë që ju nuk dini.\"", "Ai ia mësoi Ademit emrat e çdo gjëje, pastaj ua paraqiti melekëve, duke thënë: \"M'i tregoni emrat e tyre, nëse ajo që thoni është e vërtetë!\"", "Ata thanë: \"I Patëmeta je Ti! Ne nuk dimë asgjë përveç asaj që na ke mësuar Ti. Në të vërtetë, Ti je i Gjithëdijshmi, i Urti.\"", "Ai tha: \"O Adem, tregojua atyre emrat e gjërave.\" E, kur ua tregoi emrat e tyre, Allahu tha: \"A nuk ju kam thënë se Unë e di të fshehtën e qiejve dhe të Tokës dhe e di atë që e shfaqni e atë që e fshihni?\"", "Gjithashtu, kujto kur Ne u thamë melekëve: \"Përuluni në sexhde* para Ademit.\" Të gjithë ata u përulën, përveç Iblisit, i cili kundërshtoi, u tregua mendjemadh dhe u bë jobesimtar.", "Ne thamë: \"O Adem, ti e gruaja jote jetoni në Xhenet dhe hani në të lirshëm çfarë të dëshironi, por mos iu afroni kësaj peme, sepse përndryshe do të bëheni të padrejtë!\"", "Shejtani i shtyu të gabojnë dhe i nxori nga vendi ku ishin, kështu që Ne u thamë: \"Zbritni! Ju do të jeni armiq të njëri-tjetrit. Në Tokë do të jetë vendbanimi dhe furnizimi juaj deri në një kohë të caktuar.\"", "Ademi mori nga Zoti i tij disa fjalë (si të kërkonte falje), kështu që Ai ia pranoi pendimin, sepse vërtet Ai është Pranuesi i pendimit, Mëshiruesi.", "Ne u thamë: \"Zbritni së andejmi, që të gjithë! Kur t'ju vijë udhëzimi nga Unë, ata që do ta ndjekin udhëzimin Tim, as do të kenë frikë, as do të brengosen.", "Ndërkaq, ata që i mohojnë dhe i përgënjeshtrojnë shpalljet Tona, do të jenë banorë të Zjarrit, ku do të qëndrojnë përgjithmonë.\"", "O bijtë e Israilit*, kujtoni dhuntinë Time me të cilën ju kam begatuar dhe përmbushni premtimin që ma keni dhënë, që edhe Unë të përmbush premtimin që jua kam dhënë, si dhe vetëm nga Unë frikësohuni!", "Besoni në atë që e kam zbritur si vërtetues të asaj që është me ju dhe mos u bëni të parët që e mohoni atë. Po ashtu, mos i shitni ajetet e Mia për ndonjë çmim të ulët dhe kini frikë vetëm nga Unë.", "Mos e përzieni të vërtetën me të pavërtetën dhe mos e fshihni të vërtetën me vetëdije.", "Faleni namazin, jepeni zekatin dhe përkuluni bashkë me ata që përkulen (në namaz).", "Vallë, si i urdhëroni njerëzit të bëjnë mirë, kurse veten e harroni, ndërkohë që ju e lexoni Librin (Teuratin)?! A nuk mendoni?!", "Kërkoni ndihmë me durim e me namaz. Kjo është njëmend e vështirë, përveçse për të përulurit,", "të cilët janë të bindur se do ta takojnë Zotin e tyre dhe se do të kthehen tek Ai.", "O bijtë e Israilit, kujtoni dhuntinë Time me të cilën ju pata begatuar dhe ju pata ngritur mbi të gjithë njerëzit (e asaj kohe)!", "Dhe frikësojuni Ditës kur askush nuk do të mund t'i bëjë dobi askujt, kur (për jobesimtarët) nuk do të pranohet as ndërmjetësim, as shpërblesë e as që do të ndihmohen.", "Kujtoni kur ju shpëtuam nga populli i Faraonit, të cilët ju shkaktonin shumë vuajtje: jua thernin djemtë dhe jua linin të gjalla vajzat. Kjo ishte një sprovë e madhe nga Zoti juaj.", "Kujtoni si e çamë detin për ju dhe ju shpëtuam, kurse njerëzit e Faraonit i fundosëm para syve tuaj.", "Kujtoni kur Ne i caktuam Musait dyzet net (për takimin me të), ndërkohë ju e adhuruat viçin në mungesë të tij e u bëtë të padrejtë.", "Pastaj ju falëm, që të bëheni mirënjohës.", "Kujtoni kur ia dhamë Musait Librin dhe Dalluesin*, që të përudheni.", "Kujtoni kur Musai i tha popullit të vet: \"O populli im, ju i bëtë padrejtësi vetvetes duke adhuruar viçin, kështu që kthehuni të penduar te Krijuesi juaj dhe vritni njëri-tjetrin. Kjo është më mirë për ju para Krijuesit tuaj. Ai jua pranoi pendimin, sepse Ai është Pranuesi i pendimit, Mëshiruesi.\"", "Dhe kujtoni kur thatë: \"O Musa, ne nuk do të të besojmë derisa ta shohim Allahun haptazi!\", e në atë çast ju goditi rrufeja, ndërkohë që ju po shihnit (njëri-tjetrin).", "Mandej, ju kthyem në jetë pas vdekjes suaj, që të falënderoni.", "Ju bëmë hije përmes reve dhe ju zbritëm menën* dhe thëllëza, duke thënë: \"Hani nga të mirat që jua kemi dhënë!\" Ata nuk na bënë keq Neve, por i bënë keq vetvetes (duke qenë mosmirënjohës).", "Kujtoni kur thamë: \"Hyni në këtë qytet dhe hani në të lirshëm çkado që dëshironi. Hyni në portë të përkulur, duke thënë \"Falna!\", që t'jua falim gabimet. Ne ua shtojmë shpërblimet vepërmirëve.\"", "Keqbërësit e ndryshuan atë fjalë me një tjetër që nuk u ishte kërkuar, prandaj Ne zbritëm mbi ta një dënim nga qielli për shkak të mosbindjes së tyre.", "Dhe kujtoni kur Musai kërkoi ujë për popullin e tij e Ne i thamë: \"Bjeri shkëmbit me shkopin tënd!\" Atëherë, nga ai shpërthyen dymbëdhjetë burime dhe secili fis e dinte burimin e vet. Ne u thamë: \"Hani e pini nga begatitë e Allahut dhe mos bëni mbrapshti në tokë!\"", "Kujtoni kur thatë: \"O Musa, ne nuk po mund të durojmë vetëm një lloj ushqimi, prandaj lute Zotin tënd që të na japë nga gjërat që mbijnë në tokë: perime, tranguj, drithëra, thjerrëza dhe qepë.\" Ai tha: \"Vallë, a doni ta ndërroni atë që është më e mirë me atë që është më e dobët?! E po, zbritni në cilindo qytet, aty do të gjeni atë që po kërkoni.\" Kështu, mbi ta ra poshtërimi e mjerimi dhe tërhoqën mbi vete zemërimin e Allahut, për shkak se i mohonin shpalljet e Allahut dhe i vrisnin pejgamberët pa kurrfarë të drejte; kjo ndodhi ngaqë kundërshtonin dhe i tejkalonin kufijtë.", "Sigurisht, ata që kanë besuar (muslimanët), hebrenjtë, të krishterët dhe sabianët - të gjithë ata që besuan Allahun e Ditën e Gjykimit dhe bënë vepra të mira - e kanë shpërblimin te Zoti i tyre dhe për ta nuk do të ketë frikë e as që do të brengosen.*", "Kujtoni kur e morëm besën tuaj dhe e ngritëm mbi ju malin Tur, duke thënë: \"Mbajeni fort atë që jua dhamë (Teuratin) dhe kujtoni atë që përmban ai, në mënyrë që të bëheni të devotshëm.\"", "Por, pas kësaj ju kthyet shpinën dhe, po të mos ishte mirësia dhe mëshira e Allahut ndaj jush, ju do të ishit të humbur.", "Ju e dini mirë ngjarjen e atyre që tejkaluan kufijtë lidhur me ditën e shtunë, të cilëve u thamë: \"Bëhuni majmunë të përbuzur!\"", "Këtë ndëshkim e bëmë paralajmërim për bashkëkohësit e tyre dhe për ata që do të vijnë më pas si dhe këshillë për të devotshmit.", "Kujtoni kur Musai i tha popullit të vet: \"Allahu po ju urdhëron të therni një lopë\", ndërsa ata thanë: \"A po tallesh me ne?!\" Ai tha: \"Allahu më ruajttë, që të mos bëhem prej të paditurve!\"", "Ata thanë: \"Lute Zotin tënd të na e shpjegojë si duhet të jetë ajo!\" Ai tha: \"Allahu thotë se ajo duhet të jetë një lopë as e moçme, as e re, por e mesme; pra, bëjeni atë që ju është urdhëruar!\"", "Ata thanë: \"Lute Zotin tënd të na e shpjegojë çfarë ngjyre duhet të ketë ajo!\" Ai tha: \"Allahu thotë se ajo duhet të jetë një lopë me ngjyrë të verdhë të ndezur, që u pëlqen atyre që e shohin.\"", "Ata thanë: \"Lute Zotin tënd të na e shpjegojë qartë si duhet të jetë ajo, sepse të gjitha lopët na duken njësoj e ne, në dashtë Allahu, do ta gjejmë atë.\"", "Ai tha: \"Allahu thotë se ajo duhet të jetë një lopë e pastërvitur për të lëvruar tokën a për të ujitur arat, e patëmetë dhe pa ndonjë njollë.\" Ata thanë: \"Eh, tash na e solle të vërtetën.\" Kështu, e therën atë, por pothuajse e lanë pa therur.", "Kujtoni kur vratë një njeri dhe u grindët në lidhje me të, porse Allahu e nxori në shesh atë që e fshihnit.", "Ne ju thamë: \"Prekeni atë me një pjesë të saj (lopës).\" Kështu Allahu i rikthen të vdekurit në jetë dhe jua tregon shenjat e Tij, në mënyrë që të kuptoni.", "Por, pas kësaj, zemrat tuaja u ngurtësuan e u bënë si gur, madje edhe më të ngurta. Në të vërtetë, ka gurë nga të cilët burojnë lumenj, ka të atillë që çahen dhe prej tyre rrjedh uji, si dhe ka edhe të atillë që shemben nga frika e Allahut. Allahu nuk është i pavëmendshëm ndaj asaj që veproni.", "Vërtet shpresoni që ata (hebrenjtë) do t'ju besojnë juve (muslimanëve), ndërkohë që disa prej tyre e dëgjonin Fjalën e Allahut dhe e shtrembëronin me vetëdije pasi e kuptonin?!", "Kur takohen me besimtarët, thonë: \"Ne besojmë\", por, kur mbesin vetëm me njëri-tjetrin, thonë: \"A dëshironi t'u tregoni atyre për atë që jua ka shpallur Allahu (në Teurat), që të kenë dëshmi kundër jush para Zotit tuaj? A nuk po mendoni?\"", "Por, a nuk e dinë ata se Allahu e di mirë çfarë fshehin dhe çfarë shfaqin haptazi?", "Në mesin e tyre ka edhe të paditur, që nuk e njohin Librin (Teuratin), përveç leximit të tij, prandaj mbështeten vetëm në hamendje.", "Mjerë ata që e shkruajnë Librin me duart e tyre (duke e shtrembëruar atë) e pastaj thonë: \"Kjo është prej Allahut\", për të nxjerrë me këtë ndonjë fitim të parëndësishëm. Mjerë ata për atë që kanë shkruar duart e tyre dhe mjerë ata për atë që kanë fituar!", "Ata thonë: \"Ne nuk do të na prekë Zjarri, përveçse disa ditë të numëruara.\" Thuaju: \"A keni marrë ndonjë premtim nga Allahu, ndërkohë Allahu nuk e thyen premtimin, apo po thoni për Allahun diçka që nuk dini?\"", "Përkundrazi, ata që mëkatojnë (duke adhuruar dikë tjetër pos Allahut) dhe pushtohen nga fajet e veta, do të jenë banorë të Zjarrit, ku do të qëndrojnë përgjithmonë.", "Ndërkaq, ata që besojnë dhe bëjnë vepra të mira, do të jenë banorë të Xhenetit, ku do të qëndrojnë përgjithmonë.", "Kujtoni kur morëm besën tuaj, o bijtë e Israilit, se do ta adhuroni vetëm Allahun, do të silleni mirë me prindërit, të afërmit, jetimët dhe të varfrit, se do t'u thoni njerëzve fjalë të mira, do ta falni namazin dhe do ta jepni zekatin. Por, pastaj ju kthyet shpinën, përveç një pakice prej jush, duke u shmangur.", "Po ashtu, kujtoni kur morëm besën nga ju që të mos derdhni gjakun e njëri-tjetrit dhe që të mos dëboni njëri-tjetrin nga vendbanimi juaj. Ju e pranuat këtë dhe po e dëshmoni.", "Megjithatë, jeni ju ata që vrisni njëri-tjetrin dhe dëboni një grup prej jush nga vendbanimi i tyre, duke bashkëpunuar kundër tyre padrejtësisht e armiqësisht. Ndërkaq, kur ju vijnë të robëruar, ju i lironi ata (duke paguar shpërblesë), ndonëse dëbimi i tyre është i ndaluar për ju. Pra, a besoni në një pjesë të Librit (Teuratit), ndërsa e mohoni pjesën tjetër?! E çfarë mund të presin tjetër ata që veprojnë kështu, përveç poshtërimit në jetën e kësaj bote, kurse në Ditën e Kiametit do të dërgohen në dënimin më të rëndë! Allahu nuk është i pavëmendshëm ndaj asaj që veproni.", "Këta janë ata që e kanë blerë jetën e kësaj bote me botën tjetër, prandaj atyre nuk do t'u lehtësohet dënimi e as që do të ndihmohen.", "Ne ia dhamë Musait Librin (Teuratin) dhe pas tij çuam radhazi të dërguar. Ndërkaq, Isait, të birit të Merjemes, ia dhamë provat e qarta dhe e mbështetëm me Shpirtin e Dëlirë (Xhibrilin). Sa herë që ju vinte ndonjë i dërguar me diçka që nuk ju pëlqente, ju tregoheshit mendjemëdhenj, prandaj disa i quanit gënjeshtarë e disa i vrisnit.", "Ata thonë: \"Zemrat tona janë të vulosura.\" Jo, por Allahu i ka mallkuar ata për shkak të mohimit të tyre, prandaj shumë pak besojnë.", "E, kur u erdhi atyre një Libër nga Allahu (Kurani), i cili vërtetonte atë që gjendej tek ata (Teuratin dhe Inxhilin), - ndërkohë më parë ata luteshin (të vinte i Dërguari) që të fitonin kundër jobesimtarëve, - ata e mohuan atë, edhe pse u erdhi ajo që e njihnin. Prandaj, mallkimi i Allahut qoftë mbi jobesimtarët!", "Sa e keqe është ajo për të cilën ata shitën vetveten, kur mohuan atë që shpalli Allahu, nga zilia që Allahu zbret mirësinë (shpalljen) e Tij mbi këdo që dëshiron nga robërit e Vet. Kështu, ata tërhoqën mbi vete zemërim pas zemërimi. Për jobesimtarët do të ketë dënim poshtërues.", "Kur u thuhet atyre (hebrenjve): \"Besoni në atë që ka shpallur Allahu\", ata thonë: \"Ne besojmë në atë që na është shpallur neve\", ndërkohë që mohojnë atë që erdhi më pas (Kuranin), ndonëse ajo është e vërteta që pohon atë që gjendet tek ata. Thuaju atyre (o Muhamed): \"Atëherë, përse i vrisnit më parë të dërguarit e Allahut, nëse njëmend jeni besimtarë?!\"", "Juve ju erdhi Musai me prova të qarta, por pastaj ju adhuruat viçin (në mungesë të tij), duke qenë keqbërës.", "Kujtoni kur e morëm besën tuaj dhe e ngritëm mbi ju malin Tur, duke thënë: \"Mbajeni fort atë që jua dhamë (Teuratin) dhe dëgjoni.\" Ata thanë: \"Ne dëgjuam, por kundërshtojmë\", ndërkohë që në zemrat e tyre ishte rrënjosur përnderimi i viçit, për shkak të mosbesimit. Thuaju: \"Sa keq që ju urdhëruaka besimi juaj, nëse jeni besimtarë!\"", "Thuaj: \"Nëse vendbanimi i botës tjetër (Xheneti) tek Allahu është vetëm për ju e jo për njerëzit e tjerë, atëherë kërkojeni vdekjen, nëse ajo që thoni është e vërtetë!\"", "Por, ata nuk do ta dëshirojnë vdekjen asnjëherë, për shkak të të këqijave që i kanë bërë. Allahu i njeh mirë keqbërësit.", "Sigurisht që do t'i gjesh ata (hebrenjtë) njerëzit më lakmitarë për të jetuar, madje edhe më shumë se paganët. Secili prej tyre dëshiron të jetojë një mijë vjet, por, edhe po të jetonte aq, kjo nuk do t'ia shmangte atij dënimin. Allahu i sheh mirë veprimet e tyre.", "Thuaj: \"Kushdo që e armiqëson Xhibrilin, le ta dijë se ai e ka zbritur atë (Kuranin) në zemrën tënde me lejen e Allahut, si vërtetues të shpalljeve të mëhershme dhe si udhërrëfyes e lajm të mirë për besimtarët.\"", "Kushdo që armiqëson Allahun, melekët e Tij, të dërguarit e Tij, Xhibrilin dhe Mikailin, le ta dijë se Allahu është armik i jobesimtarëve.", "Sigurisht që Ne të zbritëm ty shpallje e prova të qarta, të cilat i mohojnë vetëm të pabindurit.", "Sa herë që ata jepnin ndonjë premtim, një pjesë e tyre e shkelnin atë. Në të vërtetë, shumica e tyre nuk besojnë.", "Mirëpo, kur u erdhi një i Dërguar nga Allahu (Muhamedi), i cili vërtetonte atë që kishin ata (Teuratin), një grup prej atyre që u ishte dhënë Libri e hodhën pas shpine Librin e Allahut, sikur nuk dinin asgjë.", "Ata ndoqën shpifjet e djajve lidhur me mbretërinë e Sulejmanit. Në të vërtetë, Sulejmani nuk kishte rënë në mosbesim, por djajtë kishin rënë në mosbesim, duke ua mësuar njerëzve magjinë dhe atë që u zbriti dy melekëve në Babiloni - Harutit dhe Marutit. Ata nuk ia mësonin atë (magjinë) askujt pa i thënë: \"Në të vërtetë, ne jemi sprovë, kështu që mos u bëj jobesimtar (duke mësuar magjinë)!\" Ata mësonin nga ata të dy si të ndajnë burrin nga gruaja, por ata nuk mund t'i bëjnë dëm përmes saj askujt pa lejen e Allahut. Kështu, ata mësuan atë që u sjell vetëm dëm dhe nuk u bën dobi, ndonëse e dinin mirë se, kushdo që e zgjedh atë (magjinë), nuk do të ketë kurrfarë hiseje në botën tjetër. Ah, sa e shëmtuar që është ajo për të cilën shitën veten e tyre! Veç sikur ta dinin!", "Në qoftë se ata do të besonin e do të frikësoheshin (nga Allahu), do të kishin shpërblim më të mirë tek Allahu, sikur ta dinin.", "O besimtarë! Mos thoni: \"Raina\"*, por thoni: \"Undhurna\" - \"Na shiko!\" dhe dëgjoni! E jobesimtarët i pret një dënim i dhembshëm.", "Ata që nuk besojnë, si: ithtarët e Librit dhe paganët, kurrsesi nuk dëshirojnë që juve t'ju zbresë ndonjë e mirë nga Zoti juaj. Mirëpo, Allahu ia dhuron mëshirën e Vet kujt të dojë. Allahu është Zotëruesi i mirësive të mëdha.", "Sa herë që shfuqizojmë ndonjë ajet ose bëjmë që të harrohet, sjellim ndonjë tjetër më të mirë ose të ngjashëm me të. A nuk e di ti se Allahu është i Plotfuqishëm për çdo gjë?!", "A nuk e di se Allahut i takon sundimi i Tokës e i qiellit dhe se përveç Allahut ju nuk keni as mbrojtës e as ndihmës?!", "A mos doni ta pyesni të Dërguarin tuaj (Muhamedin) ashtu siç u pyet Musai më parë?! Kushdo që këmben besimin me mosbesim, ai me të vërtetë ka humbur rrugën e drejtë.", "Shumë ithtarë të Librit, nga zilia që kanë në vete, dëshirojnë t'ju kthejnë në jobesimtarë pasi të keni besuar, edhe pasi e vërteta t'u bëhet e qartë, por ju falni dhe lërini ata, derisa Allahu të sjellë vendimin e Tij. S'ka dyshim se Allahu është i Plotfuqishëm për çdo gjë.", "Faleni namazin dhe jepeni zekatin, sepse çfarëdo të mire që të bëni për shpirtin tuaj, do ta gjeni tek Allahu. Pa dyshim, Allahu sheh mirë gjithçka që bëni.", "Ata thonë: \"Askush nuk do të hyjë në Xhenet përveç hebrenjve ose të krishterëve.\" Këto janë vetëm dëshirat e tyre boshe. Thuaju: \"Atëherë sillni provat tuaja, nëse është e vërtetë ajo që thoni!\"", "Përkundrazi! Ai që i dorëzohet plotësisht Allahut, duke qenë vepërmirë, e ka shpërblimin te Zoti i vet. Për ta nuk do të ketë frikë e as që do të brengosen.", "Hebrenjtë thonë: \"Të krishterët nuk kanë asgjë ku mund të mbështeten\", kurse të krishterët thonë: \"Hebrenjtë nuk kanë asgjë ku mund të mbështeten\", ndonëse (të dyja palët) e lexojnë Librin. Po ashtu, të njëjtat fjalë i thonë edhe të paditurit (paganët). Allahu do të gjykojë ndërmjet tyre në Ditën e Kiametit për gjërat që nuk pajtoheshin.", "Kush është më mizor se ai që ndalon të përmendet emri i Allahut në xhamitë e Tij dhe përpiqet t'i rrënojë ato?! Atyre nuk u takon të hyjnë në to, veçse të frikësuar. Për ta në këtë botë ka poshtërim, kurse në botën tjetër dënim të madh.", "Të Allahut janë lindja e perëndimi, andaj, ngado që të ktheheni, andej është Fytyra e Allahut. Me të vërtetë, Allahu është Mëshirëmadh dhe i Gjithëdijshëm.", "Ata thonë: \"Allahu ka fëmijë\". I Patëmeta është Ai! Përkundrazi! E Tij është gjithçka që gjendet në qiej e në Tokë dhe gjithçka i nënshtrohet Atij.", "Ai është Shpikësi i qiejve e i Tokës. Kur vendos të bëjë diçka, vetëm i thotë: \"Bëhu!\" dhe bëhet.", "Ata që nuk kanë dije thonë: \"Përse të mos na flasë Allahu neve ose së paku të na vijë ndonjë shenjë (mrekulli)?!\" Njësoj thoshin edhe ata që ishin para tyre. Zemrat e tyre i ngjajnë njëra-tjetrës. Ndërkohë, Ne i kemi sqaruar shenjat Tona për ata që binden.", "Pa dyshim, Ne të kemi dërguar ty (o Muhamed) me të Vërtetën si kumtues të lajmit të mirë dhe paralajmërues; ti nuk do të pyetesh për banorët e Zjarrit flakërues.", "As hebrenjtë e as të krishterët nuk do të jenë të kënaqur me ty, derisa të ndjekësh fenë e tyre. Thuaju: \"Pa dyshim, udhëzimi i Allahut është udhëzimi i vërtetë.\" Ndërkaq, nëse do të ndiqje dëshirat e tyre, edhe pas dijes që të ka ardhur, atëherë nuk do të kishe para Allahut as mbrojtës e as ndihmës.", "Ata që ua kemi dhënë Librin dhe e lexojnë ashtu siç është shpallur, ata besojnë njëmend në të. Ndërkaq, ata që e mohojnë atë, janë vërtet të humbur.", "O bijtë e Israilit, kujtoni dhuntinë Time me të cilën ju pata begatuar dhe ju pata ngritur mbi të gjithë njerëzit (e asaj kohe)!", "Frikësojuni Ditës kur askush nuk do të mund t'i bëjë dobi askujt, kur (për jobesimtarët) nuk do të pranohet shpërblesë, as do t'u bëjë dobi ndërmjetësimi e as që do të ndihmohen.", "Kujtoni kur Zoti e sprovoi Ibrahimin me disa urdhra e ai i zbatoi ata. Allahu i tha: \"Unë po të bëj prijës të njerëzve.\" Ai tha: \"Po nga pasardhësit e mi (a do të bësh prijës)?\" Allahu tha: \"Premtimi Im nuk i përfshin zullumqarët.\"", "Po ashtu, kujtoni kur Ne e bëmë Qabenë vatër kthimi dhe sigurie për njerëzit dhe (ju thamë): \"Bëjeni vendin e Ibrahimit si vend faljeje.\" Gjithashtu, i urdhëruam Ibrahimin dhe Ismailin: \"Pastrojeni Shtëpinë Time për ata që bëjnë tavaf (sillen rreth saj), që qëndrojnë në të dhe që falen duke rënë në ruku e sexhde!\"", "Kujtoni gjithashtu kur Ibrahimi u lut: \"Zoti im, bëje këtë vend të sigurt dhe furnizoji banorët e tij me fruta, ata që besojnë në Allahun dhe në Ditën e Fundit!\" Allahu tha: \"Ndërkaq, atë që nuk beson, do ta lë të kënaqet përkohësisht e pastaj do ta hedh në dënimin e Zjarrit. Eh, sa vendbanim i keq që është ai!\"", "Kujtoni kur Ibrahimi e Ismaili po ngrinin themelet e Qabesë, duke u lutur: \"Zoti ynë, pranoje prej nesh, sepse Ti je Gjithëdëgjuesi, i Gjithëdituri!", "Zoti ynë! Na bëj ne të dy të përulur ndaj Teje dhe bëj edhe nga pasardhësit tanë një shoqëri të përulur ndaj Teje! Tregona ritet (e haxhillëkut) dhe pranoje pendimin tonë, se, me të vërtetë, Ti je Pranuesi i pendimit, Mëshiruesi!", "Zoti ynë! Dërgo nga gjiri i tyre një të dërguar që t'ua lexojë ajetet (shpalljet) e Tua, t'ua mësojë Librin e Urtësinë dhe t'i pastrojë (nga mëkatet), sepse njëmend Ti je i Plotfuqishmi, i Urti.\"", "Fesë së Ibrahimit ia kthen shpinën vetëm ai që e shpërfill veten! Ne e zgjodhëm atë (Ibrahimin) në këtë botë, kurse në botën tjetër do të jetë ndër të mirët.", "Kur Zoti i tij i tha: \"Përulu!\" - ai iu përgjigj: \"I jam përulur Zotit të botëve.\"", "Këtë porosi ua la bijve të vet Ibrahimi, e edhe Jakubi: \"O bijtë e mi! Me të vërtetë, Allahu ka zgjedhur për ju këtë fe (Islamin), kështu që vdisni vetëm duke qenë muslimanë* (të përulur ndaj Allahut)!\"", "Mos vallë ishit të pranishëm kur Jakubit iu afrua vdekja dhe i pyeti të bijtë: \"Çfarë do të adhuroni pas meje?\" Ata iu përgjigjën: \"Do ta adhurojmë Zotin tënd, që është dhe Zoti i etërve të tu: Ibrahimit, Ismailit dhe Ishakut, një Zot të Vetëm. Ne Atij i përulemi.\"", "Ajo shoqëri tashmë ka kaluar; ata do të marrin atë që kanë merituar e ju do të merrni atë që meritoni dhe nuk do të pyeteni për veprat e tyre.", "Ata (hebrenjtë e të krishterët) thonë: \"Bëhuni hebrenj ose të krishterë që të përudheni!\" Thuaj: \"Përkundrazi! (Ne ndjekim) Fenë e pastër të Ibrahimit, i cili nuk ishte idhujtar.\"", "Thoni: \"Ne besojmë në Allahun, në atë që na është shpallur neve (Kuranin), në atë që u është shpallur Ibrahimit, Ismailit, Ishakut, Jakubit dhe esbatëve (pejgamberëve nga bijtë e Jakubit), në atë që u është dhënë Musait e Isait dhe në atë që u është dhënë pejgamberëve nga Zoti i tyre. Ne nuk bëjmë asnjë dallim midis tyre dhe vetëm Allahut i përulemi.\"", "Nëse ata besojnë njësoj sikurse ju, atëherë janë në rrugë të drejtë, e, nëse shmangen, atëherë do të jenë në kundërshtim. Ty (o Muhamed) do të të mjaftojë Allahu kundrejt tyre. Ai është Gjithëdëgjuesi, i Gjithëdituri.", "Pra, përmbajuni Fesë së Allahut. S'ka më të mirë se Feja e Allahut. Vetëm Atë e adhurojmë.", "Thuaju: \"A mos doni të grindeni me ne për Allahun, ndërkohë që Ai është Zoti ynë dhe Zoti juaj?! Madje, ne jemi përgjegjës për veprat tona e ju për veprat tuaja dhe ne Atij i jemi përkushtuar.\"", "Apo, mos thoni se Ibrahimi, Ismaili, Ishaku, Jakubi dhe esbatët (pejgamberët nga radhët e bijve të Jakubit) ishin jehudë ose të krishterë?! Thuaju: \"Ju e dini më mirë apo Allahu?!\" E kush është më i padrejtë se ai që fsheh ndonjë dëshmi të sjellë nga Allahu?! Allahu nuk është i shkujdesur ndaj asaj që veproni.", "Ajo shoqëri tashmë ka kaluar; ata do të marrin atë që kanë merituar e ju do të merrni atë që meritoni dhe nuk do të pyeteni për veprat e tyre.", "Njerëzit mendjelehtë do të thonë: \"Çfarë i largoi ata prej kiblës nga e cila drejtoheshin?!\" Thuaju: \"Të Allahut janë lindja e perëndimi. Ai udhëzon kë të dojë në rrugën e drejtë.\"", "Kështu, Ne ju bëmë bashkësi mesatare (të drejtë), që të jeni dëshmitarë mbi njerëzit dhe që i Dërguari të jetë dëshmitar mbi ju. Ndërkaq, kiblën nga e cila drejtoheshe e kemi bërë vetëm për të dalluar atë që e ndjek të Dërguarin nga ai që shmanget (duke dalë nga feja). Kjo (sprovë) ishte njëmend e rëndë, përveçse për ata që i udhëzoi Allahu. Allahu nuk jua humb asnjëherë besimin (e as namazin që e keni falur në drejtimin e mëparshëm). Në të vërtetë, Allahu është Përdëllimtar e i Mëshirshëm ndaj njerëzve.", "Ne kemi parë kthimin e fytyrës sate drejt qiellit, kështu që Ne do të të drejtojmë nga një kibël që të pëlqen, prandaj ktheje fytyrën tënde drejt Xhamisë së Shenjtë (Qabesë), madje kudo që gjendeni ktheni fytyrat tuaja në atë drejtim (gjatë namazit). Ata që u është dhënë Libri e dinë mirë se kjo është e vërteta nga Zoti i tyre. Ndërkohë, Allahu nuk është i shkujdesur ndaj asaj që veprojnë.", "Edhe sikur t'u sillje atyre që u është dhënë Libri çdo dëshmi, ata prapëseprapë nuk do ta ndiqnin kiblën tënde (o Muhamed). Por, as ti nuk do të ndjekësh kiblën e tyre. Madje, as ata nuk do të ndjekin kiblën e njëri-tjetrit. E, po qe se do të ndiqje dëshirat e tyre, pasi të erdhi dija, vërtet do të bëheshe i padrejtë.", "Ata që ua kemi dhënë Librin e njohin atë siç i njohin bijtë e tyre. Mirëpo, një pjesë e tyre e fshehin të vërtetën, duke e ditur mirëfilli.", "Kjo është e vërteta nga Zoti yt, kështu që kurrsesi mos u bëj nga ata që dyshojnë.", "Gjithsecili ka një drejtim nga i cili kthehet. Prandaj, garoni në punë të mira, sepse, kudo që të jeni, Allahu do t'ju tubojë. Vërtet Allahu është i Plotfuqishëm për çdo gjë.", "Ngado që të dalësh, ktheje fytyrën tënde drejt Xhamisë së Shenjtë (kur dëshiron të falesh), sepse pa dyshim që kjo është e vërteta nga Zoti yt. Allahu nuk është i shkujdesur ndaj asaj që veproni.", "Ngado që të shkosh, ktheje fytyrën tënde drejt Xhamisë së Shenjtë, madje kudo që gjendeni ktheni fytyrat tuaja në atë drejtim, në mënyrë që njerëzit të mos kenë dëshmi kundër jush, përveç keqbërësve nga radhët e tyre, ama ju mos kini frikë prej tyre, por frikësohuni prej Meje, si dhe (këtë e bëra) që të plotësoj dhuntinë Time ndaj jush dhe që të përudheni në rrugën e drejtë.", "Po ashtu, dërguam te ju një të dërguar nga mesi juaj, i cili jua lexon ajetet (shpalljet) Tona, ju pastron (nga gjynahet), jua mëson Librin e Urtësinë dhe jua mëson ato që nuk i dinit.", "Prandaj, më kujtoni Mua, që Unë t'ju kujtoj ju, si dhe më falënderoni e mos më mohoni!", "O besimtarë! Kërkoni ndihmë përmes durimit e namazit, sepse, pa dyshim, Allahu është me durimtarët!", "Dhe, për ata që vriten në rrugën e Allahut mos thoni se janë të vdekur! Jo! Ata janë të gjallë, por ju nuk e ndieni.", "Sigurisht, Ne do t'ju sprovojmë me frikë, uri dhe me ndonjë humbje të pasurisë, të jetëve dhe të frutave e të të lashtave. Prandaj, jepua lajmin e mirë të durueshmëve,", "të cilët, kur i godet ndonjë fatkeqësi, thonë: \"Të Allahut jemi dhe tek Ai do të kthehemi.\"", "Për ta do të jenë bekimet dhe mëshira nga Zoti i tyre dhe ata janë të udhëzuarit.", "Kodrinat Safa dhe Merva janë shenja të Allahut. Prandaj, ai që mësyn Qabenë për haxhillëk ose umre, nuk bën gjynah nëse ecën mes tyre. Kushdo që bën mirë vullnetarisht, le ta dijë se Allahu është Falënderues e i Gjithëdijshëm.", "Me të vërtetë, ata që fshehin atë që shpallëm nga dëshmitë dhe udhëzimet e qarta, pasi ua sqaruam njerëzve në Libër, do të mallkohen nga Allahu dhe do të mallkohen nga ata që mallkojnë.", "Përveç atyre që pendohen, përmirësohen dhe e bëjnë të qartë (atë që kishin fshehur). Të këtillëve ua pranoj pendimin, ngaqë Unë jam Pranuesi i pendimit, Mëshiruesi.", "Me të vërtetë, mbi ata që mohuan dhe vdiqën duke qenë jobesimtarë bie mallkimi i Allahut, i melekëve dhe i mbarë njerëzimit.", "Në të do të jenë përgjithmonë, nuk do t'u lehtësohet dënimi e as që do t'u jepet afat.", "Zoti juaj është Një dhe i Vetëm. S'ka të adhuruar të vërtetë përveç Tij, Ai është i Gjithëmëshirshmi, Mëshiruesi.", "Në krijimin e qiejve e të Tokës, në ndërrimin e natës me ditën, në anijet që lundrojnë në det me gjëra që u sjellin dobi njerëzve, në ujin që Allahu e zbret nga qielli, me të cilin gjallëron tokën pasi të jetë tharë dhe përhap në të gjithfarë gjallesash, si dhe në lëvizjen e erërave dhe reve të nënshtruara mes qiellit e Tokës, vërtet ka shenja për njerëzit që mendojnë.", "Megjithatë, ka njerëz që pos Allahut zgjedhin (për adhurim) zota të tjerë, duke i dashur siç duhet Allahu. Mirëpo, besimtarët e duan shumë më tepër Allahun (sesa ata që i duan idhujt e tyre). Sikur ta shihnin keqbërësit gjendjen e tyre kur do ta shohin dënimin, do ta kuptonin se tërë fuqia i takon Allahut dhe se Allahu është i rreptë në ndëshkim.", "Atëbotë, ata që ndiqeshin (prijësit), do të braktisin ndjekësit e tyre kur të shohin dënimin dhe do të shkëputet çdo lidhje mes tyre.", "Ata që u shkuan pas, do të thonë: \"Ah, sikur të mund të ktheheshim edhe njëherë e t'i braktisnim ata, ashtu siç na braktisën ne!\" Kështu, Allahu do t'ua tregojë veprat e tyre si dëshpërim për ta dhe ata s'kanë për të dalë kurrë nga Zjarri.", "O njerëz! Hani nga gjërat e lejuara e të mira që gjenden në tokë dhe mos ndiqni hapat e shejtanit, sepse ai është armik juaji i hapur.", "Në të vërtetë, ai ju nxit vetëm në të këqija e shëmtira dhe që të thoni për Allahun gjëra që nuk i dini.", "Kur atyre u thuhet: \"Ndiqni atë që ka shpallur Allahu!\", ata thonë: \"Jo! Ne do të ndjekim rrugën në të cilën i gjetëm të parët tanë.\" Vallë, edhe nëse të parët e tyre nuk kuptonin gjë dhe nuk ishin të përudhur?!", "Mohuesit u shëmbëllejnë bagëtive, të cilat, kur i thërret ndokush, dëgjojnë vetëm thirrje e zë. Ata janë të shurdhër, memecë e të verbër, andaj nuk kuptojnë asgjë.", "O ju besimtarë! Hani nga të mirat që jua dhamë dhe jini mirënjohës ndaj Allahut nëse njëmend e adhuroni vetëm Atë!", "Në të vërtetë, Ai jua ka ndaluar vetëm ngordhësirën, gjakun, mishin e derrit dhe atë që është therur jo në emër të Allahut. Por, nëse ndokush detyrohet të hajë diçka prej tyre, pa dashur të mëkatojë dhe pa i kaluar kufijtë, për të nuk ka gjynah. Vërtet, Allahu është Falës i Madh e Mëshirues.", "Sigurisht, ata që fshehin atë që ka shpallur Allahu në Libër, duke e këmbyer me diçka të pavlerë, në barqet e tyre do të gëlltisin vetëm zjarr. Atyre nuk do t'u flasë Allahu në Ditën e Kiametit, as do t'i pastrojë (nga mëkatet) dhe për ta do të ketë dënim të dhembshëm.", "Ata këmbyen udhëzimin me humbje dhe mëshirën me dënim. Sa të durueshëm që janë ndaj Zjarrit!", "Kjo, se Allahu e ka zbritur Librin me të vërtetën, porse ata që nuk pajtohen rreth Librit janë vërtet në një përçarje të largët (nga e vërteta).", "Mirësia nuk është në kthimin e fytyrave tuaja në drejtim të lindjes e të perëndimit, por mirësia (e vërtetë) është në atë që beson Allahun, Ditën e Fundit, melekët, Librat dhe pejgamberët; që jep pasurinë e tij, - edhe përkundër dashurisë që ka për të, - për të afërmit, jetimët, të varfrit, për udhëtarin e mbetur rrugës, për lypsarët dhe për lirimin e robërve; si dhe që e fal namazin dhe e jep zekatin; dhe (mirësia qëndron edhe) në ata që përmbushin premtimet e dhëna dhe në ata që bëjnë durim në skamje, sëmundje dhe kur ashpërsohet lufta. Këta janë të vërtetët dhe pikërisht këta janë të devotshmit.", "O besimtarë! Është caktuar për ju kisasi* për vrasje: i liri për të lirin, skllavi për skllavin dhe femra për femrën. Nëse i afërmi i të vrarit e fal vrasësin (duke pranuar dëmshpërblimin), atëherë dëmshpërblimi duhet të kërkohet njerëzishëm dhe të zbatohet (nga vrasësi) në mënyrë të mirë. Kjo është lehtësim dhe mëshirë nga Zoti juaj. E, kushdo që pas kësaj i kalon kufijtë, do të ketë dënim të dhembshëm.", "Në kisas ka siguri për jetën tuaj, o mendarë, që të bëheni të devotshëm.", "Ju është caktuar që, kur ndonjërit prej jush i afrohet vdekja dhe lë pas pasuri, të lërë porosi (testament) për prindërit dhe të afërmit në mënyrë të drejtë. Kjo është detyrë për të devotshmit.", "Kushdo që e ndryshon (testamentin) pasi ta ketë dëgjuar, le ta dijë se mëkati bie mbi ata që e ndryshojnë. Pa dyshim, Allahu është Gjithëdëgjues, i Gjithëdijshëm.", "Mirëpo, ai që druan se trashëgimlënësi, gabimisht a qëllimisht, i është shmangur drejtësisë dhe bën marrëveshje mes tyre (trashëgimtarëve), nuk ka asnjë mëkat. Me të vërtetë, Allahu është Falës i Madh dhe Mëshirues.", "O besimtarë! Agjërimi është bërë detyrë për ju siç ishte detyrë edhe për ata që ishin para jush, që të bëheni të devotshëm.", "Një numër i caktuar ditësh. Por, nëse ndokush nga ju është i sëmurë a në udhëtim, atëherë le t'i shlyejë ato (duke agjëruar) në ditë të tjera. Ata që kanë mundësi të agjërojnë, duhet të shpaguajnë (për mosagjërim) duke ushqyer një të varfër. Kush bën mirë vullnetarisht, e ka për të mirën e vet, por të agjëroni është më mirë për ju, veç sikur ta dinit.", "Muaji Ramazan është ai në të cilin zbriti Kurani, që është udhërrëfyes për njerëzit dhe sqarues i udhëzimit e dallues (i së vërtetës nga e kota). Ai që e arrin këtë muaj, le ta agjërojë, kurse ai që është i sëmurë a në udhëtim, le ta shlyejë me po aq ditë të tjera. Allahu dëshiron t'jua lehtësojë e jo t'jua vështirësojë. Po ashtu, (dëshiron) ta plotësoni numrin (e ditëve të agjërimit), ta madhëroni Allahun që ju ka udhëzuar dhe ta falënderoni.", "E, kur robërit e Mi të pyesin për Mua, (thuaju se) Unë jam afër, i përgjigjem duasë së lutësit kur më lutet. Andaj, le të më binden Mua dhe le të më besojnë, që të përudhen (në rrugën e drejtë).", "Tashmë ju është lejuar që, gjatë netëve të agjërimit, të keni marrëdhënie intime me bashkëshortet tuaja. Ato janë prehje për ju dhe ju jeni prehje për to. Allahu e ka ditur se ju po e mashtronit vetveten, andaj jua pranoi pendimin dhe jua fali gabimin. Tash e tutje bëni marrëdhënie me to dhe kërkoni atë që jua ka caktuar Allahu. Hani e pini derisa të dallohet fija e bardhë (bardhësia) e agimit nga fija e zezë (errësira e natës), pastaj plotësojeni agjërimin deri në mbrëmje. Por, mos iu afroni atyre (për marrëdhënie intime) gjatë kohës së itikafit (kur mbylleni për adhurim) në xhami. Këta janë kufijtë e Allahut, ndaj mos iu afroni. Kështu pra Allahu ua sqaron njerëzve ajetet (shpalljet dhe normat) e Tij, në mënyrë që të ruhen.", "Mos e hani pasurinë e njëri-tjetrit padrejtësisht e as mos u paraqitni me të te gjykatësit për të përvetësuar një pjesë të pasurisë së njerëzve në mënyrë të ndaluar, përderisa e dini (se po bëni mëkat).", "Të pyesin (o Muhamed) për fazat e hënës, thuaju: \"Ato janë për njerëzit shenja për përcaktimin e kohës dhe haxhillëkut.\" Nuk është mirësi të hyni në shtëpi nga mbrapa, por mirësi është të keni frikë Allahun. Andaj, hyni në shtëpi nga dyert e veta dhe kijeni frikë Allahun, që të shpëtoni.", "Luftoni në rrugën e Allahut kundër atyre që ju luftojnë, por mos i kaloni kufijtë, sepse me të vërtetë Allahu nuk i do ata që i kalojnë kufijtë.", "Vritini ata kudo që t'i ndeshni dhe dëbojini nga vendi që ju dëbuan. Fitneja* është më e rëndë se vrasja. Mirëpo, mos i luftoni ata pranë Xhamisë së Shenjtë derisa ata t'ju luftojnë aty. E, po qe se ju luftojnë, atëherë vritini. I këtillë është ndëshkimi i jobesimtarëve.", "Mirëpo, në qoftë se ata heqin dorë, atëherë Allahu është Falës i Madh e Mëshirues.", "Luftojini ata derisa të mos ketë më fitne (adhurim të dikujt a diçkaje tjetër pos Allahut) dhe të mbretërojë vetëm feja e Allahut. E, nëse ata heqin dorë, atëherë s'ka armiqësi, përveçse ndaj mizorëve.", "Muaji i shenjtë do të shpaguhet me muaj të shenjtë dhe për shkeljen e gjërave të pacenueshme ka kisas (ndëshkim në të njëjtën mënyrë). Nëse ndokush ju sulmon, duke tejkaluar kufirin, atëherë sulmojini edhe ju në po atë masë. Kijeni frikë Allahun dhe dijeni se Allahu është me të devotshmit.", "Shpenzoni në rrugën e Allahut e mos e hidhni veten me duart tuaja në shkatërrim. Bëni mirë, sepse Allahu i do bamirësit.", "Kryejeni plotësisht haxhillëkun dhe umrën për hir të Allahut. E, në qoftë se ju del ndonjë pengesë, atëherë therni çka t'ju vijë më lehtë prej kurbaneve dhe mos i rruani kokat derisa të arrijë kurbani në vendin e caktuar. Por, nëse ndokush nga ju është i sëmurë ose ka ndonjë lëndim në kokë (që e detyron ta rruajë kokën), le ta shpaguajë atë me agjërim, lëmoshë ose kurban. E, kur të ndiheni të sigurt, kushdo që bën umrën deri në haxhillëk (në muajt e haxhillëkut), le të therë një kurban që i vjen më lehtë. Ndërkaq, ai që s'ka mundësi, le të agjërojë tri ditë gjatë haxhillëkut dhe shtatë kur të ktheheni. Këto janë dhjetë (ditë) të plota. Kjo vlen për ata, familjarët e të cilëve nuk jetojnë pranë Xhamisë së Shenjtë (nuk janë banorë të Mekës). Mirëpo, frikësojuni Allahut dhe dijeni se Allahu është i rreptë në ndëshkim.", "Haxhillëku është në muaj të caktuar.* Ai që vendos ta kryejë haxhillëkun, le të largohet nga marrëdhëniet (me gruan), mëkatimi dhe grindjet gjatë tij. Çfarëdo të mire që veproni, Allahu e di. Pajisuni me gjërat e nevojshme për rrugë, por dijeni se pajisja më e mirë është devotshmëria. Prandaj, kini frikë nga Unë, o mendarë!", "Nuk keni gjynah nëse kërkoni ndonjë të mirë nga Zoti juaj (duke bërë tregti gjatë haxhillëkut). Kur të ktheheni nga Arafati, përmendeni Allahun te Meshari Harami (në Muzdelife). Përmendeni Atë që ju ka udhëzuar, sepse më parë ishit të humbur.", "Pastaj nisuni nga nisen të gjithë njerëzit dhe kërkoni falje nga Allahu, sepse Allahu është Falës i Madh e Mëshirues.", "Kur t'i mbaroni ritet tuaja (të haxhillëkut), përmendeni Allahun, ashtu siç i kujtoni baballarët tuaj, ose edhe më shumë. Ka njerëz që thonë: \"Zoti ynë, na jep të mira në këtë botë!\", por për ta në botën tjetër nuk ka kurrfarë hiseje.", "Mirëpo, ka edhe të atillë që thonë: \"Zoti ynë, na jep të mira në këtë botë, na jep të mira në botën tjetër dhe na ruaj nga dënimi i Zjarrit.\"", "Ata kanë shpërblim për veprat që kanë bërë. Allahu është i shpejtë në llogari.", "Përmendeni Allahun gjatë ditëve të caktuara (të teshrikut)*. Kush ngutet të dalë (nga Mina) pas dy ditësh, nuk ka mëkat, por as ai që rri (një ditë) më shumë nuk ka mëkat. Kjo vlen për atë që ka frikë nga Allahu. Prandaj, frikësojuni Allahut dhe dijeni se tek Ai do të tuboheni.", "Ndër njerëz ka edhe të atillë, fjalët e të cilit të mahnitin në këtë botë, madje ai betohet në Allahun për atë që mban në zemër, ndonëse ai, në të vërtetë, është kundërshtari më i përbetuar.", "E, posa të largohet, përpiqet të bëjë çrregullime në tokë dhe të shkatërrojë të mbjellat e bagëtitë. Ndërkohë, Allahu nuk e do shkatërrimin.", "E, kur i thuhet: \"Kije frikë Allahun!\", e kaplon kryelartësia dhe ngul këmbë në mëkat. Atij i mjafton Xhehenemi. Eh, sa vendbanim i keq që është ai!", "Ka edhe njerëz të atillë që flijojnë vetveten për të fituar kënaqësinë e Allahut. Allahu është i Mëshirshëm për robërit e Vet.", "O besimtarë! Hyni në Islam tërësisht e mos ndiqni gjurmët e shejtanit, ngaqë ai është armik juaji i hapur.", "E, nëse shmangeni edhe pasi ju kanë ardhur dëshmitë e qarta, atëherë dijeni se Allahu është i Gjithëfuqishëm, i Urtë.", "A mos presin tjetër ata veçse t'u vijë Allahu në hijen e reve (në Ditën e Gjykimit) bashkë me melekët?! Atëherë çështja merr fund! Tek Allahu kthehen të gjitha çështjet.", "Pyeti bijtë e Israilit se sa e sa dëshmi të qarta ua dhamë Ne atyre. Ai që mohon të mirat e Allahut, pasi t'i kenë ardhur, le ta dijë se Allahu është i rreptë në ndëshkim.", "Jobesimtarëve u është hijeshuar jeta e kësaj bote, prandaj tallen me besimtarët. Mirëpo, ata që i frikësohen Allahut, do të jenë sipër tyre në Ditën e Kiametit. Allahu begaton pa masë atë që do.", "Njerëzit qenë një bashkësi e vetme (në besimin e vërtetë). Më pas, Allahu dërgoi pejgamberët me lajme të mira e paralajmërime, e bashkë me ta zbriti edhe Librin (Shkrimet e Shenjta) me të vërtetën, për të gjykuar mes njerëzve lidhur me çështjet për të cilat nuk pajtoheshin. Në kundërshti ranë vetëm ata të cilëve iu dha ai (Teurati), pasi u erdhën dëshmitë e qarta, duke i kaluar kështu kufijtë mes tyre. Atëherë, Allahu, me vullnetin e Tij, i udhëzoi drejt së vërtetës ata që besuan lidhur me çështjet për të cilat kundërshtoheshin. Allahu udhëzon kë të dojë në rrugën e drejtë.", "A mos menduat se do të hyni në Xhenet pa ju prekur sprovat e atyre që ishin para jush?! Ata u goditën nga mjerimi e sëmundjet dhe u tronditën aq shumë, saqë i Dërguari bashkë me ata që besuan thirrën: \"Kur do të arrijë ndihma e Allahut?\" Ja, ndihma e Allahut është afër.", "Të pyesin se çka duhet të japin (nga pasuria). Thuaju: \"Çfarëdo të mire që jepni, le të jetë për prindërit, të afërmit, jetimët, skamnorët dhe për udhëtarin e mbetur rrugës.\" Çfarëdo të mire që bëni, s'ka dyshim se Allahu e di.", "Lufta është bërë detyrim për ju, ndonëse nuk e pëlqeni. Mirëpo, ju mund të urreni një gjë, ndërkohë që ajo është e mirë për ju. Po ashtu, ju mund të doni një gjë, ndërkohë që ajo është e dëmshme për ju. Allahu e di, kurse ju nuk e dini.", "Të pyesin për luftën në muajin e shenjtë. Thuaju: \"Lufta në të është gjë e rëndë, por pengimi nga rruga e Allahut, mohimi i Tij, pengimi (i njerëzve) nga Xhamia e Shenjtë dhe dëbimi i banorëve të saj nga ajo është mëkat edhe më i rëndë tek Allahu. Fitneja (shirku - adhurimi i dikujt a diçkaje tjetër pos Allahut) është më e rëndë se vrasja. Ata do t'ju luftojnë vazhdimisht derisa t'ju zmbrapsin nga feja juaj, po patën mundësi. Atyre që zmbrapsen nga feja dhe vdesin duke qenë jobesimtarë, do t'u asgjësohen veprat (e mira) në këtë botë dhe në tjetrën. Të tillët janë banorë të Zjarrit, ku do të qëndrojnë përgjithmonë.", "Me të vërtetë ata që besuan dhe ata që mërguan e luftuan në rrugën e Allahut, pikërisht ata shpresojnë në mëshirën e Allahut. Allahu është Falës i Madh e Mëshirues.", "Të pyesin për verën dhe kumarin. Thuaju: \"Në to ka mëkat të madh dhe ca dobi për njerëzit, por mëkati i tyre është më i madh se dobia.\" Gjithashtu, të pyesin se çfarë duhet të japin (si lëmoshë). Thuaju: \"Tepricën.\" Ja, kështu jua sqaron Allahu shpalljet e Tij në mënyrë që të mendoni", "për këtë botë dhe për botën tjetër. Të pyesin edhe për jetimët. Thuaju: \"T'ua përmirësoni kushtet atyre është më mirë. E, në qoftë se bashkoheni me ta (duke përzier pasurinë tuaj me të tyren), ata janë vëllezërit tuaj. Allahu di të dallojë qëllimkeqin nga qëllimmiri. Po të donte Allahu, do t'jua vështirësonte (çështjen). Vërtet Allahu është i Plotfuqishëm, i Urtë.\"", "Mos u martoni me idhujtare derisa të bëhen besimtare. Sigurisht, një skllave besimtare është më e mirë se një idhujtare, edhe po qe se ajo ju mahnit; as mos i martoni muslimanet me idhujtarë derisa të bëhen besimtarë. S'ka dyshim se një skllav besimtar është më i mirë se një idhujtar, edhe po qe se ai ju mahnit. Ata ju thërrasin për në Zjarr, kurse Allahu, me vullnetin e Tij, ju thërret për në Xhenet e për falje mëkatesh dhe ua shpjegon njerëzve shpalljet e Veta, që të marrin mësim.", "Të pyesin për të përmuajshmet. Thuaju: \"Ajo është gjendje e dëmshme, ndaj shmanguni nga gratë gjatë të përmuajshmeve dhe mos iu afroni atyre (për marrëdhënie intime) derisa të pastrohen. Kur të pastrohen, afrojuni atyre siç jua ka lejuar Allahu. Me të vërtetë, Allahu i do ata që pendohen dhe i do ata që pastrohen.\"", "Gratë tuaja janë vend mbjelljeje për ju, kështu që qasjuni këtij vendi ngado që dëshironi. Mirëpo, përgatitni vepra të mira për veten tuaj. Kijeni frikë Allahun dhe dijeni se do ta takoni Atë, si dhe jepu sihariq besimtarëve.", "Betimin në Allahun mos e bëni pengesë për kryerjen e veprave të mira, për të qenë të devotshëm dhe për pajtimin e njerëzve. Allahu është Gjithëdëgjues, i Gjithëdijshëm.", "Allahu nuk ju merr në llogari për betimet tuaja të paqëllimshme, por për ato që i bëni me zemër (qëllimisht). Allahu është Falës i Madh e i Butë.", "Për ata që betohen se nuk do t'u afrohen grave të veta (për marrëdhënie intime), afati i pritjes është katër muaj. Në qoftë se kthehen (duke hequr dorë nga betimi), atëherë Allahu është Falës i Madh e Mëshirues.", "Mirëpo, nëse vendosin të ndahen, atëherë vërtet Allahu është Gjithëdëgjues, i Gjithëdijshëm.", "Gratë e ndara duhet të presin tri cikle mujore dhe atyre nuk u lejohet të fshehin atë që ka krijuar Allahu në mitrat e tyre, nëse e besojnë Allahun dhe Ditën e Fundit. Burrat e tyre kanë të drejtë t'i kthejnë ato gjatë kësaj kohe, në qoftë se duan pajtim. Ato kanë po aq të drejta sa dhe detyra, sipas arsyes së shëndoshë, ndonëse burrat kanë një shkallë sipër tyre. Allahu është i Plotfuqishëm dhe i Urtë.", "Ndarja (pas së cilës burri mund ta rikthejë gruan) mund të bëhet dy herë. Pastaj, ose ta mbajë gruan në mënyrë të hijshme, ose ta lëshojë me mirësi. Burrave nuk u lejohet të marrin asgjë nga ajo që u kanë dhënë grave të veta (për martesë), përveç nëse ata të dy kanë frikë se nuk do të mund t'u përmbahen kufijve të Allahut. Pra, po qe se frikoheni se ata të dy nuk do të mund t'i përfillin kufijtë e Allahut, atëherë nuk është gjynah për asnjërin nëse gruaja i jep diçka burrit (për t'u ndarë nga ai). Këta janë kufijtë e Allahut, andaj mos i shkelni. Ata që i shkelin kufijtë e Allahut, mu ata janë keqbërësit.", "Nëse ai e lëshon gruan (për të tretën herë), atëherë ajo nuk i lejohet më atij derisa të jetë martuar me ndonjë burrë tjetër dhe ai ta ketë ndarë; atëherë ata nuk kanë mëkat nëse martohen sërish*, po qe se mendojnë se do t'u përmbahen kufijve të Allahut. Këta janë urdhrat e Allahut, të cilët ua shpjegon njerëzve që dinë.", "Kur t'i ndani gratë dhe atyre t'u afrohet fundi i kohës së pritjes, ose mbajini si duhet, ose lëshojini në mënyrë të hijshme, e mos i mbani me qëllim lëndimi, sepse ai që vepron ashtu, i bën padrejtësi vetvetes. Mos luani me shpalljet e Allahut dhe kujtojini dhuntitë që jua ka dhënë Allahu dhe atë që jua zbriti nga Libri (Kurani) dhe Urtësia (Suneti), me të cilin ju këshillon. Kijeni frikë Allahun dhe dijeni se Allahu është i Dijshëm për çdo gjë.", "Kur burrat t'i kenë ndarë gratë dhe kur këto ta kenë plotësuar kohën e pritjes, mos i pengoni ato që të martohen sërish me burrat e tyre, në qoftë se të dyja palët pajtohen në mënyrë të arsyeshme. Kjo këshillë vlen për çdonjërin nga ju që e beson Allahun dhe Ditën e Fundit. Kjo është më e dobishme dhe më e pastër për ju. Allahu di, kurse ju nuk dini.", "Nënat le t'u japin gji fëmijëve të tyre plot dy vjet, për ata që duan ta plotësojnë kohën e gjidhënies. Babai e ka për detyrë të sigurojë për to ushqimin dhe veshmbathjen, në mënyrë të arsyeshme. Askush nuk ngarkohet përtej mundësive që ka. Le të mos dëmtohet nëna nëpërmjet fëmijës së saj e as babai përmes fëmijës së tij. Për trashëgimtarin vlejnë të njëjtat detyrime (në rast se nuk është gjallë babai i fëmijës). Nëse prindërit, pas marrëveshjes dhe këshillimit të ndërsjellë, vendosin ta ndajnë fëmijën nga gjiri (para se t'i mbushë dy vjet), nuk bëjnë gjynah. Mirëpo, nëse doni t'i gjeni ndonjë mëndeshë, nuk keni mëkat, nëse ia jepni pagën në mënyrë të duhur. Kijeni frikë Allahun dhe dijeni se Allahu sheh mirë gjithçka që bëni.", "Gratë të cilave u vdes burri, duhet të presin katër muaj e dhjetë ditë. Kur të kalojë koha e pritjes, ju nuk keni përgjegjësi për atë që ato bëjnë në mënyrë të ligjshme me vetveten. Allahu di hollësisht çfarë veproni.", "Nuk është gjynah për ju nëse grave të tilla ua shfaqni tërthorazi dëshirën për martesë ose e mbani atë në vetvete. Allahu e di se ju do t'i kujtoni ato, mirëpo mos u premtoni atyre fshehurazi (martesë), porse mund t'u thoni vetëm fjalë të arsyeshme. As mos lidhni martesë pa mbaruar koha e pritjes. Dijeni se Allahu di ç'keni në zemra, andaj frikësojuni Atij dhe dijeni se me të vërtetë Allahu është Falës i Madh dhe i Butë.", "Nuk është gjynah për ju nëse i lëshoni gratë para se të keni marrëdhënie me to ose para se t'ua caktoni mehrin*. Mirëpo, jepuni atyre diçka nga pasuria: i pasuri sipas mundësisë së tij dhe i varfri sipas mundësisë së vet; një dhuratë të arsyeshme. Kjo është detyrë për bamirësit.", "E, nëse i lëshoni para se të keni marrëdhënie me to, por pasi t'ua keni caktuar mehrin, atëherë juve ju takon gjysma e mehrit të caktuar, përveç nëse ato heqin dorë ose heq dorë ai që në dorë ka lidhjen e martesës, porse të falni është më afër devotshmërisë. Mirëpo, mos e harroni bujarinë mes jush. Pa dyshim, Allahu sheh mirë gjithçka që bëni.", "Kushtojuni kujdes namazeve, veçanërisht namazit të mesëm dhe faluni duke qenë të përulur ndaj Allahut.", "Në qoftë se keni frikë (nga armiku), faluni duke ecur ose duke qenë hipur (mbi kalë a mbi deve). Kur të siguroheni, atëherë përmendeni Allahun (duke e falur namazin të plotë), ashtu si ju ka mësuar Ai atë që nuk e keni ditur.", "Ata prej jush që janë në prag të vdekjes dhe lënë gra pas vetes, duhet të lënë porosi për gratë e tyre që të kenë mjetet e jetesës për një vit të plotë pa u dëbuar nga shtëpia. Mirëpo, nëse ato dalin vetë, atëherë ju nuk keni përgjegjësi për atë që bëjnë ato me vetveten në mënyrë të ligjshme. Allahu është i Plotfuqishëm, i Urtë.", "Edhe grave të ndara u takon një pjesë e arsyeshme e pasurisë. Kjo është detyrë për të devotshmit.", "Kështu jua sqaron Allahu shpalljet e Veta, në mënyrë që të kuptoni.", "A nuk ke dëgjuar për ata mijëra njerëz që ikën nga vendbanimet e tyre nga frika e vdekjes?! Allahu u tha atyre: \"Vdisni!\" e pastaj i ringjalli. Me të vërtetë, Allahu është shumë Bamirës ndaj njerëzve, por shumica e tyre nuk e falënderojnë.", "Luftoni në rrugën e Allahut dhe dijeni se Allahu është Gjithëdëgjues, i Gjithëdijshëm.", "Kush është ai që do t'i japë Allahut ndonjë hua të mirë (duke shpenzuar pasurinë në rrugën e Allahut), që Ai t'ia shtojë atë shumëfish? Allahu ia pakon dhe ia shton rizkun kujt të dojë dhe tek Ai do të ktheheni.", "A nuk ke dëgjuar për parinë e bijve të Israilit, pas Musait, të cilët i thanë një pejgamberi të tyre: \"Na cakto një mbret, që të luftojmë në rrugën e Allahut.\" Ai tha: \"Po sikur të mos luftoni pasi t'ju caktohet lufta?\" Ata thanë: \"E si të mos luftojmë në rrugën e Allahut ne që jemi dëbuar nga vendbanimet tona dhe jemi ndarë nga djemtë tanë?\" Mirëpo, kur u urdhëruan të luftojnë, ata u zmbrapsën, me përjashtim të një pakice. Allahu i njeh mirë keqbërësit.", "Pejgamberi i tyre u tha: \"Allahu jua ka dërguar Talutin për mbret.\" Ata thanë: \"Si mund të jetë ai mbret yni, kur neve na takon më shumë sundimi?! Madje, ai as që ka ndonjë pasuri të madhe.\" Ai tha: \"Allahu e zgjodhi atë kundrejt jush dhe e pajisi me dituri të gjerë e me fuqi trupore. Allahu ia jep pushtetin kujt të dojë. Allahu është Bujar i Madh dhe i Gjithëdijshëm.", "Pejgamberi u tha atyre: \"Shenjë e sundimit të tij është që t'ju vijë arka që e bartin melekët, ku ka prehje nga Zoti juaj dhe disa gjëra të lëna nga familja e Musait dhe familja e Harunit. Sigurisht se kjo është një shenjë e qartë për ju, po qe se jeni besimtarë.", "Kur doli Taluti me ushtrinë e tij (nga qyteti), u tha atyre: \"Allahu do t'ju provojë me një lumë. Ai që pi prej tij, nuk është me mua*, kurse ai që nuk pi, përpos një grusht, është me mua. Të gjithë pinë, përveç një pakice. Kur ai me besimtarët e kaluan atë, disa thanë: \"Ne sot nuk kemi fuqi kundër Xhalutit dhe ushtrisë së tij.\" Mirëpo, ata që ishin të bindur se do të takoheshin me Allahun, thanë: \"Sa e sa grupe të vogla kanë mposhtur grupe të mëdha me lejen e Allahut! Allahu është me durimtarët.\"", "Kur u ballafaquan me Xhalutin dhe ushtrinë e tij, thanë: \"Zoti ynë, na jep durim, na i forco këmbët dhe na ndihmo kundër popullit jobesimtar!\"", "Atëherë, me ndihmën e Allahut i mposhtën ata (jobesimtarët). Kështu, Davudi e vrau Xhalutin dhe Allahu ia dha atij pushtetin e urtësinë (pejgamberllëkun) dhe e mësoi nga ajo që deshi Ai. Po të mos ishte përkrahja e Allahut për disa njerëz kundër të tjerëve*, do të prishej Toka, por Allahu është shumë Bujar ndaj krijesave.", "Këto janë ajetet e Allahut, të cilat po t'i lexojmë me vërtetësi. S'ka dyshim se ti je i dërguar.", "Këta janë të dërguarit, disa prej të cilëve i kemi dalluar kundrejt disa të tjerëve. Prej tyre ka që Allahu u ka folur drejtpërdrejt, e disa i ka ngritur në shkallë të larta. Isait, të birit të Merjemes, ia dhamë mrekullitë e qarta dhe e përforcuam me Shpirtin e Dëlirë (Xhibrilin). Sikur të donte Allahu, ata që erdhën pas tyre nuk do të vriteshin ndërmjet vete pas ardhjes së provave të qarta, por u përçanë; disa prej tyre besuan, kurse të tjerët mohuan. Sikur të donte Allahu, ata nuk do të vrisnin njëri-tjetrin, por Allahu bën si të dojë Vetë.", "O besimtarë! Jepni nga të mirat që jua dhamë para se të vijë një Ditë në të cilën nuk do të ketë shitblerje, as miqësi e as ndërmjetësi. Jobesimtarët janë keqbërësit e vërtetë.", "Allahu! Nuk ka zot që meriton të adhurohet përveç Tij, të Gjallit, të Përjetshmit, Mbajtësit të gjithçkaje. Atë nuk e kap dremitja e as gjumi. Atij i takon gjithçka që gjendet në qiej dhe gjithçka që gjendet në Tokë. E kush mund të ndërmjetësojë tek Ai pa lejen e Tij?! Ai e di ç'do të ndodhë në të ardhmen dhe ç'ka ndodhur në të kaluarën, ndërsa ata nuk mund të mësojnë asgjë nga dituria e Tij, përveç aq sa dëshiron Ai. Kursia* e Tij përfshin qiejt e Tokën dhe Atij nuk i vjen rëndë ruajtja e tyre. Ai është i Larti, Madhështori.", "S'ka detyrim në fe, meqë tashmë është dalluar e drejta nga e shtrembra. Ai që mohon tagutin (çdo gjë që adhurohet pos Allahut) dhe e beson Allahun, është kapur për lidhjen më të fortë, e cila nuk këputet. Allahu është Gjithëdëgjues, i Gjithëdijshëm.", "Allahu është Mbrojtësi i besimtarëve: i nxjerr ata nga errësirat në dritë. Ndërkaq, mbrojtësit e jobesimtarëve janë tagutët (kushdo që adhurohet pos Allahut): i nxjerrin ata nga drita në errësira. Këta janë banorët e Zjarrit, ku do të qëndrojnë përgjithmonë.", "A ke dëgjuar për atë që u fjalëtua me Ibrahimin për Zotin e tij, thjesht ngaqë Allahu i kishte dhënë atij pushtet?! Kur Ibrahimi tha: \"Zoti im është Ai që jep jetë dhe shkakton vdekje\", ai tha: \"Edhe unë jap jetë dhe shkaktoj vdekje.\" Ibrahimi i tha: \"Allahu e sjell Diellin nga lindja, e sille ti nga perëndimi!\" Atëherë, jobesimtari mbeti pa fjalë. Allahu nuk i udhëzon në rrugë të drejtë zullumqarët.", "Ose, (ke dëgjuar) për atë i cili, kur kaloi pranë një qyteti të shkretuar e të bërë rrafsh me tokë, tha: \"Vallë, si mund ta kthejë Allahu këtë qytet në jetë pasi ka vdekur?!\" Atëherë Allahu e bëri të vdesë atë për njëqind vjet, pastaj e ringjalli dhe e pyeti: \"Sa kohë ke qëndruar (i vdekur)?\" Ai tha: \"Kam qëndruar një ditë ose një pjesë dite.\" Ai tha: \"Jo, por ke qëndruar plot njëqind vjet. Shikoje ushqimin e pijen tënde: ende nuk janë prishur! Gjithashtu, shiko gomarin tënd! Kështu Ne po të bëjmë ty dëshmi të qartë për njerëzit (se Allahu ka fuqi t'i ringjallë ata). Vështroji eshtrat (e gomarit) sesi i bashkojmë dhe më pas i veshim me mish!\" Kur iu bë e qartë, tha: \"Tashmë e di se Allahu është i Plotfuqishëm për çdo gjë.\"", "Kujto edhe Ibrahimin kur tha: \"Zoti im, tregomë si i ngjall të vdekurit!\" Tha: \"A nuk beson?\" Tha: \"Besoj gjithsesi, por dëshiroj të më qetësohet zemra.\" Ai tha: \"E po, merri katër zogj pranë vetes dhe (pasi t'i therësh) shpërndaj në çdo kodër nga një pjesë prej tyre. Pastaj thirri, do të të vijnë me rrëmbim. Dije se Allahu është i Plotfuqishëm, i Urtë.", "Ata që e japin pasurinë në rrugën e Allahut i shëmbëllejnë një kokrre nga e cila dalin shtatë kallinj, ku çdo kalli ka nga njëqind kokrra. Allahu ia shumëfishon (shpërblimin) atij që dëshiron. Allahu është shumë Bujar dhe i Gjithëdijshëm.", "Ata që e japin pasurinë e tyre në rrugën e Allahut dhe, atë që e japin nuk e përcjellin me përmendje a me fyerje, e kanë shpërblimin te Zoti i tyre. Për ta nuk do të ketë frikë e as që do të brengosen.", "Një fjalë e mirë dhe një falje gabimi është më me vlerë se lëmosha që përcillet me fyerje. Allahu është i Panevojë, i Butë.", "O besimtarë! Mos i prishni lëmoshat tuaja me përmendje e fyerje, sikurse ai që e jep pasurinë e tij vetëm për sy të njerëzve, ndërkohë nuk e beson Allahun dhe Ditën e Fundit. Ai i shëmbëllen një guri të lëmuar që sipër ka dhé, mbi të cilin bie një shi i rrëmbyer dhe e lë të zhveshur. Atyre nuk u bëjnë dobi veprat që kanë bërë. Allahu nuk e udhëzon popullin jobesimtar.", "Ata që shpenzojnë pasurinë e vet, duke kërkuar kënaqësinë e Allahut dhe me bindje të plotë, i shëmbëllejnë një kopshti në një rrafshnaltë pjellore, ku bie një shi i dendur, ndaj jep fruta dyfish. E, në mos rëntë shi i dendur, i mjafton një shi i lehtë. Allahu sheh mirë gjithçka që bëni.", "A do të dëshironte ndonjëri prej jush të kishte një kopsht përplot hurma e rrush, të përshkuar nga lumenjtë dhe me fruta të gjithëllojshme, ndërkohë që atë ta kishte zënë pleqëria, të kishte fëmijë të dobët dhe të goditej kopshti nga një stuhi zjarri e të shkrumbohej?!* Ja, kështu jua sqaron Allahu shpalljet e Veta, në mënyrë që të mendoni.", "O besimtarë! Jepni nga të mirat që i fitoni dhe nga prodhimet që nxjerrim për ju nga toka e mos synoni të dhuroni më të keqen nga ato, të cilën as ju vetë nuk do ta pranonit, pos symbyllur. Dijeni se Allahu është i Panevojë dhe i Lavdëruar.", "Shejtani ju frikëson me skamje dhe ju nxit në mëkate, kurse Allahu ju premton faljen dhe mirësinë e Vet. Allahu është Bujar i Madh e i Gjithëdijshëm.", "Ai i jep urtësinë kujt të dojë, ndërkohë atij që i jepet urtësia, i është dhënë mirësi e madhe. Këtë e kuptojnë vetëm mendarët.", "Çfarëdo të mire që dhuroni dhe çfarëdo zotimi që bëni, Allahu e di mirë, ndërkaq për keqbërësit nuk ka ndihmës.", "Në qoftë se jepni lëmoshë haptazi, kjo është gjë e mirë, e, nëse e fshihni atë dhe ua jepni të varfërve, kjo është më mirë për ju dhe ju shlyen disa mëkate. Allahu di hollësisht çfarë veproni.", "Ti (o Muhamed) nuk e ke për detyrë t'i udhëzosh ata në rrugën e drejtë, por është Allahu Ai që udhëzon kë të dojë. Çfarëdo të mire që jepni, është në dobinë tuaj, përderisa e bëni vetëm për hir të Allahut. Çfarëdo të mire që dhuroni, do ta gjeni dhe nuk do t'ju bëhet padrejtësi.", "(Lëmosha) le të jetë për të varfrit, të cilët u penguan (nga lufta) në rrugën e Allahut e nuk mund të udhëtojnë nëpër tokë (për të fituar). Ai që nuk i njeh, kujton se janë të kamur, sepse nuk lypin, por ata mund t'i njohësh nga pamja e tyre; ata nuk lypin me këmbëngulje. Sigurisht, Allahu është i Gjithëdijshëm për çfarëdo të mire që bëni.", "Ata që e japin pasurinë e tyre natën e ditën, fshehurazi e haptazi, e kanë shpërblimin te Zoti i tyre. Për ta nuk do të ketë frikë e as që do të brengosen.", "Ata që e hanë kamatën, nuk ringjallen ndryshe pos si ai që është çmendur nga prekja e shejtanit. Kjo, se ata thonë se tregtia është njëlloj si kamata! Mirëpo, Allahu e ka lejuar tregtinë, porse e ka ndaluar kamatën. Atij që i vjen këshilla nga Zoti i vet dhe heq dorë (nga kamata), i takon ajo që ka kaluar, ndërsa çështja e tij është tek Allahu. Ndërkaq, ata që i kthehen (marrjes së kamatës), do të jenë banorë të Zjarrit, ku do të qëndrojnë përgjithmonë.", "Allahu zhduk kamatën (dhe përfitimet prej saj), kurse e rrit lëmoshën (duke shtuar bereqetin dhe shpërblimet e saj). Allahu nuk e do asnjë mohues gjynahqar.", "Sigurisht, ata që besojnë, bëjnë vepra të mira, e falin namazin dhe e japin zekatin, e kanë shpërblimin te Zoti i tyre. Për ta nuk do të ketë frikë e as që do të brengosen.", "O ju që keni besuar! Frikësojuni Allahut dhe hiqni dorë nga pjesa e mbetur e kamatës, nëse njëmend jeni besimtarë.", "Nëse nuk e bëni këtë, atëherë merrni njoftimin për luftë nga Allahu dhe i Dërguari i Tij. E, nëse pendoheni, atëherë juve ju takon vlera e pasurisë suaj, në mënyrë që të mos bëni padrejtësi dhe të mos ju bëhet e padrejtë.", "E, nëse ndokush është ngushtë, atëherë priteni derisa t'i lehtësohet gjendja. Mirëpo, në qoftë se ia falni (borxhin), është më mirë për ju, sikur ta dinit.", "Frikësojuni Ditës kur do të ktheheni tek Allahu, kur çdokush do të marrë atë që ka fituar dhe askujt nuk do t'i bëhet padrejtësi.", "O besimtarë! Kur të merrni hua nga njëri-tjetri për një afat të caktuar, shkruajeni. Le të shënojë një shkrues i drejtë nga mesi juaj dhe të mos kundërshtojë të shkruajë ashtu siç e ka mësuar Allahu. Ai le të shënojë, ndërsa borxhliu le të diktojë dhe le ta ketë frikë Allahun, Zotin e vet, pa lënë mangët asgjë nga borxhi. Në qoftë se borxhliu është mendjelehtë a i dobët ose nuk mund të diktojë, atëherë le të diktojë drejt kujdestari i tij. Gjithashtu, merrni dy dëshmitarë burra nga mesi juaj. Mirëpo, nëse nuk gjenden dy burra, atëherë një burrë e dy gra nga ata që i shihni të përshtatshëm për të dëshmuar, në mënyrë që, nëse njëra harron, ia kujton tjetra. Të mos kundërshtojnë dëshmitarët kurdo që të thirren. Mos përtoni ta shkruani borxhin, qoftë i madh, qoftë i vogël, duke shënuar edhe afatin e tij. Kjo është më e drejtë tek Allahu, më e përshtatshme sa i përket dëshmisë dhe më afër mosdyshimit, përveç nëse është shitblerje e çastit, e në atë rast nuk keni gjynah nëse nuk e shënoni. Mirëpo, merrni dëshmitarë kur bëni shitblerje dhe të mos dëmtohet asnjë shkrues e dëshmitar. Nëse e bëni një gjë të tillë (dëmtoni ndonjërin nga ata), atëherë kjo është mëkat nga ana juaj, ndaj kijeni frikë Allahun. Allahu ju mëson; Allahu është i Gjithëdijshëm për çdo gjë.", "Nëse jeni në udhëtim dhe nuk gjeni shkrues, atëherë merrni peng. E, në qoftë se njëri prej jush ka besim te tjetri, atëherë borxhliu le ta kthejë atë që i është besuar dhe le t'i frikësohet Allahut, Zotit të vet. Mos e fshihni dëshminë, sepse ai që e fsheh atë ka zemër mëkatare. Allahu di mirë gjithçka që bëni.", "E Allahut është gjithçka që gjendet në qiej dhe gjithçka që gjendet në Tokë. Pavarësisht a e shfaqni apo e fshihni atë që mbani në shpirt, Allahu do t'ju marrë në llogari për të. Pastaj, ia fal kujt të dojë dhe dënon kë të dojë. Allahu është i Plotfuqishëm për çdo gjë.", "I Dërguari beson në atë që i është shpallur nga Zoti i tij, e edhe besimtarët. Të gjithë ata besojnë në Allahun, melekët, Librat dhe të dërguarit e Tij (duke thënë:) \"Ne nuk bëjmë dallim mes asnjë të dërguari të Tij.\" Ata thonë: \"Dëgjojmë dhe bindemi. Faljen Tënde kërkojmë, o Zoti ynë, dhe te Ti është kthimi!\"", "Allahu nuk rëndon askënd përtej mundësive që ka. Në dobi të tij është e mira që bën, kurse në dëm të tij është e keqja që vepron. \"Zoti ynë, mos na ndëshko nëse harrojmë ose gabojmë! Zoti ynë, mos na ngarko me barrë të rëndë, siç i ngarkove ata që ishin para nesh! Zoti ynë, mos na ngarko sa nuk kemi fuqi! Na i shlyej mëkatet, na fal dhe na mëshiro! Ti je Mbrojtësi ynë, prandaj na ndihmo kundër njerëzve jobesimtarë.\""], ["Elif, lam, mim.", "Allahu! Nuk ka zot që meriton të adhurohet përveç Tij, i Gjalli, i Përjetshmi, Mbajtësi i gjithçkaje.", "Ai ta zbriti ty Librin (o Muhamed) me të vërtetën, që është vërtetues i shpalljeve të mëparshme. Ai zbriti Teuratin dhe Inxhilin", "më parë, si udhëzim për njerëzit dhe zbriti edhe Dalluesin (e së vërtetës nga e kota). Sigurisht se ata që i mohojnë Shpalljet e Allahut i pret një dënim i rëndë. Allahu është i Plotfuqishëm dhe i Zoti për shpagim.", "Pa dyshim, Allahut nuk i fshihet asgjë në Tokë e as në qiell.", "Ai ju formon në mitra, ashtu si dëshiron Vetë. Nuk ka zot që meriton të adhurohet përveç Tij, të Plotfuqishmit, të Urtit.", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", ""], ["", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", "", "", "", ""], ["", "", "", "", "", "", "", ""], ["", "", ""], ["", "", "", "", "", "", "", "", ""], ["", "", "", "", ""], ["", "", "", ""], ["", "", "", "", "", "", ""], ["", "", ""], ["", "", "", "", "", ""], ["", "", ""], ["", "", "", "", ""], ["", "", "", ""], ["", "", "", "", ""]]